name=input('Здравствуйте! Как Вас зовут?')
print(f'Очень приятно, {name}! Меня зовут Марк.')
old=int(input('Сколько Вам лет?'))
if old<78:
    r=78-old
    print(f'Да, {name}, я старше Вас на {r} лет.')
else:
    r=old-78
    print(f'Да, {name}, Вы старше меня на {r} лет.')
a=input('Вам нравится программировать? ')
if a=='да' or a=='Да':
    print('Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.')
else:
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.')
