sh=input('Собака короткошерстной породы? ')
if sh=='да':
    r=input('Рост собаки менее 50см? ')
    if r=='да':
        h=input('У собаки короткий хвост? ')
        if h=='да':
            print('английский бульдог')
        else:
            y=input('У собаки длинные уши?')
            if y=='да':
                print('гончая')
            else:
                t=input('У собаки короткое тело? ')
                if t=='да':
                    print('мопс')
                else:
                    print('чихуахуа')
    else:
        v=input('Собака весит более 50кг?')
        if v=='да':
            print('датский дог')
        else:
            print('фоксхаунд')
else:
    r = input('Рост собаки менее 50см? ')
    if r=='да':
        har=input('У собаки доброжелательный характер? ')
        if har=='да':
            print('кокер-спаниэль')
        else:
            print('ирландский сеттер')
    else:
        rost=input('У собаки рост менее 70см? ')
        if rost=='да':
            yh=input('У собаки длинные уши?')
            if yh=='да':
                print('большой вандейский грифон')
            else:
                print('колли')
        else:
            ok=input('Окрас рыжий с белыми отметинами?')
            if ok=='да':
                print('сенбернар')
            else:
                bo=input('белосснежный окрас?')
                if bo=='да':
                    print('ирландский волкодав')
                else:
                    print('ньюфаундленд')

